{"characterDetails":{"character":{"id":7251316,"persona_id":8600115,"name":"Skorched","class":{"id":12,"name":"Demon Hunter","slug":"demon-hunter"},"race":{"id":10,"name":"Blood Elf","slug":"blood-elf","faction":"horde"},"faction":"horde","level":120,"spec":{"name":"Havoc","slug":"havoc"},"path":"/characters/us/andorhal/Skorched","realm":{"id":257,"connectedRealmId":131,"name":"Andorhal","altName":null,"slug":"andorhal","altSlug":"andorhal","locale":"en_US","isConnected":true},"region":{"name":"United States & Oceania","slug":"us","short_name":"US"},"gender":"male","achievementPoints":20355,"honorableKills":5482,"itemLevelEquipped":443,"itemLevelTotal":445,"thumbnailUrl":"//render-us.worldofwarcraft.com/character/andorhal/211/154564051-avatar.jpg?alt=wow/static/images/2d/avatar/10-0.jpg","guild":{"id":114168,"name":"Threat Level Midnight","faction":"horde","realm":{"id":492,"connectedRealmId":131,"name":"Zuluhed","altName":null,"slug":"zuluhed","altSlug":"zuluhed","locale":"en_US","isConnected":true},"region":{"name":"United States & Oceania","slug":"us","short_name":"US"},"path":"/guilds/us/zuluhed/Threat Level Midnight"},"talents":"2121100","talentsDetails":[{"specId":577,"icon":"ability_demonhunter_felblade","spellId":232893,"classId":12,"tierId":0,"columnId":2},{"specId":577,"icon":"inv_weapon_shortblade_92","spellId":203555,"classId":12,"tierId":1,"columnId":1},{"specId":577,"icon":"inv_felbarrage","spellId":258925,"classId":12,"tierId":2,"columnId":2},{"specId":577,"icon":"spell_shadow_manafeed","spellId":205411,"classId":12,"tierId":3,"columnId":1},{"specId":577,"icon":"ability_deathwing_bloodcorruption_death","spellId":206416,"classId":12,"tierId":4,"columnId":1},{"specId":577,"icon":"ability_demonhunter_chaosnova","spellId":206477,"classId":12,"tierId":5,"columnId":0},{"specId":577,"icon":"spell_shadow_demonform","spellId":213410,"classId":12,"tierId":6,"columnId":0}]},"characterCustomizations":{"profile_banner":"classbanner_warlock1","profile_frame":null,"biography":"<p>I've played since Vanilla, unfortunately lost my original account during Wrath of the Lich King and ended up making a new one where I began maining a Holy Paladin. I've played the Horde ever since day one while dabbling in some Alliance spies over the years, much like how I almost exclusively played Orcs in Warcraft 1 and 2 but would try out the Humans from time to time just to get an idea of the differences between them.</p>\n<p>I originally began the game as a Tauren Warrior on Silvermoon (US) which was a PVE server, back in March 2005, during what us Canadians call March Break. Basically our version of Spring Break. My two best friends also picked Tauren, one was a Druid and the other was a Shaman. They both got the server first Swift Zulian Tiger and Swift Razzashi Raptor mounts back when Zul'Gurub came out, which of course made me crazy jealous as I was never able to get into raids being a DPS warrior. Guilds on our server only really had Prot Warriors with maybe one or two DPS Warriors, even though they were very powerful.</p>\n<p>I only managed to get into MC, ZG and AQ20 one or two times and only managed to ever get a single epic before The Burning Crusade launched, aside from a bunch of the T0.5 pieces, however I think I only had one or two that were actually epic pieces.</p>\n<p>Then came The Burning Crusade where I leveled my trusty Warrior once again, but also took my highest level alt, an Undead Priest named Lacerate, and also leveled him. This became the first expansion where I tried healing and found that I really loved it. I ended up raiding on my Priest as Holy and essentially ignored my Warrior for this expansion, aside from farming gold to get that elusive Epic Flying Mount. I mostly raided in a guild called Fate Sealed which a friend of mine in high school was a part of. I ended up clearing Karazhan, Gruul's Lair and a large portion of Serpentshrine Cavern, but never downed Lady Vashj as I worked while going to school, so I couldn't make raids very often.</p>\n<p>By the end of that expansion, my friend had learned about the 20,000G mount that was going to be available in Wrath of the Lich King, so he farmed the dailies in Isle of Quel'Danas every single day to accumulate the gold to buy that mount on day one. And he did actually manage to do it too. I didn't even get Epic Flying until Wrath, however.</p>\n<p>Wrath of the Lich King was the first expansion I was so anxious for that I actually downloaded a leaked Friends and Family Alpha so I could get my hands on it early. The idea of a Death Knight class was too cool for me to wait. Once the expansion came out, I immediately started a Death Knight and leveled it to 80 so I could get myself into Naxxramas finally as well. Back then, Death Knights tanked using Frost and Blood was actually a DPS spec. I can't remember which DPS spec was most viable though as I had no idea what I was doing with the Death Knight until the following expansion where I started to PVP as a Frost Death Knight and a Restoration Druid. During the following patch cycle where Ulduar was released, my friend who mained the Tauren Druid in Vanilla was now maining a Mage. He ended up getting all of the best in slot gear possible from Ulduar and ended up selling his account (he was the one with the Swift Razzashi Raptor as well). From what I recall he sold his account for $800 and used that money for weed and a new GPU. We were both living together at this point too, since we were now in College. </p>\n<p>I was flaky with WoW over the years and would usually play every other patch cycle, so I missed out on Ulduar until Trial of the Crusader was out. However, since my friend and I were living together and he had sold his account, once I got back into WoW; he of course wanted back in too. So I used an account that one of my other friends from high school had, as I knew he had a Paladin around the 50's that I could level to max. I allowed my friend to use my account and he decided to play my warrior while I switched to playing a Holy Paladin. This was the first time Heroic was introduced into the game as well, so it was always a desire of ours to get in there and get those 232's (I think that was the item level at the time?). The paladin was actually on Andorhal (US) though, so I had to make new friends and join a new guild. My friend transferred my warrior to Andorhal as well so we could get into the same guild. This was actually the same server one of the more renowned guilds was on, Simple Math. We ended up joining a guild called Sinful where we had a lot of fun, but the guild didn't have many raiders and we only ever managed to do 10 man runs. There was something cool about such a small raid size though. I was used to raiding in 25 man SSC before Wrath came out, so it was cool to get back to raiding in a Karazhan or UBRS style raid. </p>\n<p>Our guild was fairly behind though, so we were still running Ulduar a lot (one of my all time favourite raids) while also trying to clear Trial of the Crusader along with clearing Vault of Archavon in Wintergrasp every week as well. Andorhal had a 3 or 4:1 ratio on Alliance so I don't actually remember a time when we didn't control Wintergrasp. Wrath of the Lich King was also the first time I really tried to do well in PVP as we decided that doing some guild PVP was important in order to make the Faction Champions boss easier for everyone involved. Most of our guild had never PVP'd so they were unfamiliar with a lot of the mechanics of their class which would make that boss way easier.</p>\n<p>As we were finally farming Ulduar and Trial of the Crusader, our guild leader and raid leader somehow get an in with Simple Math to have them and myself get into their alt-25 man Trial of the Crusader group. We were the only ones geared enough to be let into their alt run, but I felt pretty proud to be considered good enough to run with them. Of course, it was not my scene, it was far too intense and toxic of a raid environment. So I only went for one or two weeks and told them to count me out eventually. </p>\n<p>Then came my end for Wrath. Patch 3.3 was on the PTR and I started running the new dungeons and seeing the new changes to Holy Paladins. This was the point where they added Holy Power to Paladins and completely changed how the class worked in all three specs. I was extremely frustrated and didn't feel like relearning my class, so instead of learning the changes or leveling a new healer, I quit for a raid that I really wish I got to experience when it was brand new... Icecrown Citadel. I missed out on both ICC and Ruby Sanctum as I only came back a few weeks before the launch of Cataclysm so I could see the world before it changed forever. However I was too late, they had already put in the 4.0 pre-patch by the time I came back and was shocked by all the changes. </p>\n<p>By this point I wasn't nearly as excited about the game overall. My roommate and I got back into the game for the expansion launch, but I ended up quitting before even getting into any raiding in the first bit of the expansion. I don't even remember what character I leveled when the expansion first came out. Eventually I came back when Blackwing Descent was out, right before the 4.2 patch for Firelands was coming out. I for some reason decided to level a Mage from scratch and ended up raiding in Blackwing Descent as an Arcane Mage which I don't think I ever really figured out how to play properly. I swapped between Fire, Frost and Arcane multiple times to try and find a playstyle I liked, and the changes to Fire in Cataclysm were really cool so I eventually stuck with that. Good thing resistances were no longer a thing to worry about, because this was when Firelands came out and whatever guild I was in at the time started to clear it. I think I only ever managed to clear 2 or 3 bosses in Firelands before quitting once again though. I then came back for 4.3 which really killed my hopes for the game overall at that point. Seeing LFR introduced for Dragon Soul seemed ridiculous. I hopped into LFR on my mage after doing a couple of the new dungeons to gear up a little bit, and we facerolled the entire raid. After seeing the entire raid down and being insanely disappointed with the last two fights with Deathwing, I once again quit.</p>\n<p>The next time I played the game was when the pre-order for Mists of Pandaria came out which gave access to the Beta. What a horrible idea that was though. Blizzard had so many people pre-order that they had to do Beta invites in massive waves which happened every few days. There were so many people on the Beta that it was impossible to do pretty much anything though. The Pandaren starting area was completely flooded to the point where it took hours just to finish the first quests to level 6 or so. Once the expansion finally launched, I immediately rolled a Pandaren Monk named Hwaeom and leveled as a Mistweaver. Back then, Mistweavers were the most broken leveling spec in the game because you could endlessly cast Spinning Jade Kick which did lots of damage while simultaneously healing you for any damage you would take. So you could easily pull 8 - 12 mobs at a time with not even a remote threat of death. Plus having the bonus XP for being a Monk, I managed to level to 88 really quickly. I think I grinded out those levels in a week and a half. Unfortunately I grinded a bit too hard and quit when I was about halfway through 88. During this time I got addicted to drugs and missed out on the entire expansion. Something I really wish didn't happen because I've gone back and done the majority of the content in Mists of Pandaria now, and it seems like it was a really well designed expansion with tons of things to do. </p>\n<p>I didn't end up playing again until a week before Warlords of Draenor was supposed to come out and by that time I was clean and sober, taking methadone maintenance doses to prevent withdrawals. And this was when they had nerfed the XP needed to get to 90, so I walked into a new village and immediately hit level 89. So of course I leveled to 90 and then decided to transfer my Monk back to good old Silvermoon, and onto the Alliance as a Draenei for some unknown reason. That character went unplayed until some time in Legion when I leveled him to 100 and he still sits at level 100 as of 8.2. As for Warlords of Draenor, I don't actually remember what class I leveled first, but I eventually got my Death Knight to 100 and cleared Highmaul, Blackrock Foundry and everything but Archimonde in Hellfire Citadel. Clearning Highmaul and Blackrock Foundry was done during the Hellfire Citadel patch cycle though, so that was obviously easier content. I really didn't play very much during WoD though. I got almost all of the achievements done for flying except for the Tanaan Jungle stuff, and didn't get WoD flying until somewhere around 7.2. </p>\n<p>Legion ended up being the longest I played the game since Wrath of the Lich King. My absolute favourite expansion by far since then as well. I had a blast playing the Demon Hunter (even though I wouldn't end up maining one until BfA) and I ended up really starting to feel like I understood the game more than simply knowing my one spec that I raided as. This was where I really took every alt I had and made them all characters I spent time on. Over the years I would generally have a main and two alts at max level, and I would play one spec on all of them. I changed mains every expansion as well, where I would also generally change my alts, so I had accumulated a whole bunch of different alts by this point. The only character that was below level 80 by Legion was my new Warrior that I slowly leveled only to about 52. Since I was pretty determined to play a Warrior in this expansion, I leveled him all the way to 110 and started to learn the ins and outs of both Arms and Fury with a little bit of dabbling into Prot. I simultaneously played my Demon Hunter where I would just do some PVP and the world content. I still hopped in and out of the game during the first bit of Legion though. I only did LFR for Emerald Nightmare, Trial of Valor and Nighthold. Once Tomb of Sargeras came out, I got back into the game again for a bit to see that raid, but only in LFR again. I mostly focused on solo content and leveling alts until 7.3 came out where I played for a crazy 7 months straight. The longest I might've ever played WoW without quitting.</p>\n<p>I was still just leveling alts and dabbling in all kinds of different things, but I ended up hitting 110 on my Hunter and saw a group of people sitting on this gorgeous bird mount. That mount of course ended up being the AotC mount for Antorus. I said the mount looked amazing and asked how you get it, to which I received a group invite. This group happened to be just about to start their raid night where they did the last couple bosses of Nighthold (a warrior in the guild was trying to get a titanforged trinket out of there, I can't remember which one, but it was bis of course). They then ran me through the entirety of Tomb of Sargeras where I got flooded with gear. Finally we ran through the entirety of Antorus on heroic and I got my mount right after the run. I spent the vast majority of this raid dead, as I knew none of the mechanics and had literally hit 110 5 minutes before meeting this group. They also became my guild for the remainder of Legion and the first couple months of BfA. I actually can't even remember the name of the guild, even though I spent so much time raiding with them and doing various other content with them. I completely avoided doing Mythic+ until getting into this guild too. Mythic+ intimidated me way too much before I finally got dragged into them and realized they were really fun. </p>\n<p>By this point I had every class in the game maxed out and I ran through every class campaign, plus the Broken Shore campaign on every character in order to get every class mount. This was also the very first time I ever bothered farming reps as I never felt compelled to do it over this long journey through every expansion. It's actually a good thing too because I ended up making my Demon Hunter the main character I do all old content on. So I now have 61 reps exalted with him, as well as all kinds of other content done on him, which tends to be way more fun to do while playing Havoc.</p>\n<p>Now in BfA I have finally found a guild that I love to be a part of while I am also much more healthy mentally and physically, so it's been much easier to have an enjoyable experience with raiding and doing M+ content. I now main my Demon Hunter and will tank or dps whenever it's needed. I absolutely hated BfA in 8.0 and only really played to get AotC on G'Huun and then I quit again. But I'm back for 8.2 clearing Eternal Palace and feeling like there is enough content at end game as well as still clearing the old content I've missed over the years, to keep me active for the foreseeable future. Especially if the leak of WoW: Shadowlands comes true... That entire expansion concept seems fascinating to me and I really want to be a part of it.</p>\n<p>I don't know why I felt compelled to spend an hour and a half typing this all out, but here it is. A really truncated, abbreviated history of my years playing WoW.</p>","main_character":null,"bnet_battletag":null,"twitch_profile":"","youtube_profile":"","twitter_profile":"","discord_profile":"","wowhead_profile":"","isClaimed":true},"patronLevel":null,"meta":{"firstCrawledAt":"2017-05-17T20:37:49.000Z","lastCrawledAt":"2019-12-14T08:03:12.000Z","loggedOutAt":"2019-12-08T01:05:54.000Z","missingAt":null},"newsArticle":null,"raidProgress":[{"raid":"antorus-the-burning-throne","aotc":"2018-02-15T08:33:00.000Z","cuttingEdge":null,"encountersDefeated":{"normal":[],"heroic":[{"slug":"imonar-the-soulhunter","firstDefeated":"2018-05-16T07:44:07.000Z","itemLevel":937,"artifactTraits":76,"numKills":1,"lastDefeated":"2018-05-16T07:44:07.000Z"},{"slug":"kingaroth","firstDefeated":"2018-05-16T08:12:15.000Z","itemLevel":937,"artifactTraits":76,"numKills":1,"lastDefeated":"2018-05-16T08:12:15.000Z"},{"slug":"varimathras","firstDefeated":"2018-05-16T08:41:50.000Z","itemLevel":937,"artifactTraits":76,"numKills":1,"lastDefeated":"2018-05-16T08:41:50.000Z"}],"mythic":[]}}],"itemDetails":{"item_level_equipped":443,"item_level_total":445,"artifact_traits":4587450,"items":{"head":{"item_id":158364,"item_level":450,"item_quality":4,"is_legion_legendary":false,"is_azerite_armor":true,"azerite_powers":[{"id":13,"spell":{"id":263978,"school":0,"icon":"inv_smallazeriteshard","name":"Azerite Empowered","rank":null},"tier":999},{"id":15,"spell":{"id":263962,"school":0,"icon":"ability_vehicle_shellshieldgenerator_green","name":"Resounding Protection","rank":null},"tier":1},{"id":99,"spell":{"id":271540,"school":0,"icon":"inv_legendary_shield","name":"Ablative Shielding","rank":null},"tier":2},{"id":221,"spell":{"id":275350,"school":0,"icon":"ability_demonhunter_demonspikes","name":"Rigid Carapace","rank":null},"tier":3},{"id":134,"spell":{"id":272983,"school":0,"icon":"ability_demonhunter_fierybrand","name":"Revel in Pain","rank":null},"tier":3}],"gems":[],"bonuses":[5448,1617,4786,6270]},"neck":{"item_id":158075,"item_level":473,"item_quality":6,"is_legion_legendary":false,"is_azerite_armor":false,"azerite_powers":[],"heart_of_azeroth":{"essences":[{"slot":0,"id":5,"rank":3,"power":{"id":19,"essence":{"id":5,"name":"Essence of the Focusing Iris","shortName":"Essence of the Focusing Iris","description":""},"tierId":3,"majorPowerSpell":{"id":299338,"school":2,"icon":"spell_azerite_essence12","name":"Focused Azerite Beam","rank":"Azerite Essence"},"minorPowerSpell":{"id":299337,"school":0,"icon":"inv_radientazeritematrix","name":"Focused Energy","rank":null}}},{"slot":1,"id":12,"rank":4,"power":{"id":48,"essence":{"id":12,"name":"The Crucible of Flame","shortName":"The Crucible of Flame","description":"A raging fire is a force of massive destruction, and the bringer of new life."},"tierId":4,"majorPowerSpell":{"id":299353,"school":0,"icon":"spell_azerite_essence_15","name":"Concentrated Flame","rank":"Azerite Essence"},"minorPowerSpell":{"id":299350,"school":0,"icon":"inv_radientazeritematrix","name":"Ancient Flame","rank":null}}},{"slot":2,"id":14,"rank":3,"power":{"id":55,"essence":{"id":14,"name":"Condensed Life-Force","shortName":"Condensed Life-Force","description":"The Heart of Azeroth is capable of maipulating Azerite in ways never thought possible."},"tierId":3,"majorPowerSpell":{"id":299358,"school":0,"icon":"spell_azerite_essence14","name":"Guardian of Azeroth","rank":"Azerite Essence"},"minorPowerSpell":{"id":299357,"school":0,"icon":"inv_radientazeritematrix","name":"Condensed Life-Force","rank":null}}}],"level":70,"progress":0,"totalForLevel":84495},"gems":[],"bonuses":[6316,4932,4933]},"shoulder":{"item_id":159307,"item_level":450,"item_quality":4,"is_legion_legendary":false,"is_azerite_armor":true,"azerite_powers":[{"id":13,"spell":{"id":263978,"school":0,"icon":"inv_smallazeriteshard","name":"Azerite Empowered","rank":null},"tier":999},{"id":466,"spell":{"id":280012,"school":0,"icon":"spell_misc_zandalari_council_soulswap","name":"Burning Soul","rank":null},"tier":1},{"id":21,"spell":{"id":263984,"school":0,"icon":"ability_skyreach_four_wind","name":"Elemental Whirl","rank":null},"tier":2},{"id":355,"spell":{"id":278501,"school":0,"icon":"ability_demonhunter_hatefulstrike","name":"Essence Sever","rank":null},"tier":3},{"id":558,"spell":{"id":288878,"school":0,"icon":"warlock_curse_shadow","name":"Hour of Reaping","rank":null},"tier":3}],"gems":[],"bonuses":[5448,1617,4786,6271]},"back":{"item_id":159289,"item_level":440,"item_quality":4,"is_legion_legendary":false,"is_azerite_armor":false,"azerite_powers":[],"gems":[],"bonuses":[5010,42,1612,4783]},"chest":{"item_id":159330,"item_level":450,"item_quality":4,"is_legion_legendary":false,"is_azerite_armor":true,"azerite_powers":[{"id":13,"spell":{"id":263978,"school":0,"icon":"inv_smallazeriteshard","name":"Azerite Empowered","rank":null},"tier":999},{"id":83,"spell":{"id":268437,"school":0,"icon":"inv_pet_inquisitoreye","name":"Impassive Visage","rank":null},"tier":1},{"id":89,"spell":{"id":267683,"school":0,"icon":"spell_yorsahj_bloodboil_orangeoil","name":"Azerite Veins","rank":null},"tier":2},{"id":354,"spell":{"id":278502,"school":0,"icon":"ability_demonhunter_sigilofinquisition","name":"Cycle of Binding","rank":null},"tier":3},{"id":134,"spell":{"id":272983,"school":0,"icon":"ability_demonhunter_fierybrand","name":"Revel in Pain","rank":null},"tier":3}],"gems":[],"bonuses":[5448,1617,4786,6269]},"waist":{"item_id":159301,"item_level":440,"item_quality":4,"is_legion_legendary":false,"is_azerite_armor":false,"azerite_powers":[],"gems":[],"bonuses":[5010,40,1612,4783]},"wrist":{"item_id":159324,"item_level":445,"item_quality":4,"is_legion_legendary":false,"is_azerite_armor":false,"azerite_powers":[],"gems":[168642],"bonuses":[5009,4802,1597,5865,4784]},"hands":{"item_id":168376,"item_level":430,"item_quality":4,"enchant":5937,"is_legion_legendary":false,"is_azerite_armor":false,"azerite_powers":[],"gems":[168642],"bonuses":[4799,1808,1502,4786]},"legs":{"item_id":159345,"item_level":440,"item_quality":4,"is_legion_legendary":false,"is_azerite_armor":false,"azerite_powers":[],"gems":[],"bonuses":[5010,1612,4783]},"feet":{"item_id":159327,"item_level":440,"item_quality":4,"is_legion_legendary":false,"is_azerite_armor":false,"azerite_powers":[],"gems":[],"bonuses":[5010,40,1612,4783]},"finger1":{"item_id":169156,"item_level":430,"item_quality":4,"enchant":6111,"is_legion_legendary":false,"is_azerite_armor":false,"azerite_powers":[],"gems":[168637],"bonuses":[4779,4802,1472,5860,4784]},"finger2":{"item_id":159459,"item_level":450,"item_quality":4,"enchant":6111,"is_legion_legendary":false,"is_azerite_armor":false,"azerite_powers":[],"gems":[],"bonuses":[5010,1602,5865,4784]},"trinket1":{"item_id":168676,"item_level":440,"item_quality":4,"is_legion_legendary":false,"is_azerite_armor":false,"azerite_powers":[],"gems":[153708],"bonuses":[]},"trinket2":{"item_id":169310,"item_level":430,"item_quality":4,"is_legion_legendary":false,"is_azerite_armor":false,"azerite_powers":[],"gems":[],"bonuses":[4799,1502,4786]},"mainhand":{"item_id":168900,"item_level":445,"item_quality":4,"enchant":5962,"is_legion_legendary":false,"is_azerite_armor":false,"azerite_powers":[],"gems":[],"bonuses":[4800,1517,4786]},"offhand":{"item_id":168276,"item_level":445,"item_quality":4,"enchant":5963,"is_legion_legendary":false,"is_azerite_armor":false,"azerite_powers":[],"gems":[],"bonuses":[4800,1517,4786]}}},"seasonName":"Season 7.3.2","mythicPlusScores":{"all":{"score":206.0251484938476,"scoreColor":"#ffffff","runs":[{"zoneId":7546,"keystoneRunId":10490105,"mythicLevel":15,"clearTimeMs":2254627,"score":138.60271568855072},{"zoneId":7812,"keystoneRunId":9619597,"mythicLevel":6,"clearTimeMs":712688,"score":67.42243280529688}],"rawRuns":[{"id":10490105,"region_id":2,"realm_id":257,"keystone_team_id":17018563,"zone_id":7546,"faction":"horde","mythic_level":15,"clear_time_ms":2254627,"par_time_ms":1980999,"period":646,"completed_at":"2018-05-21T06:28:13.000Z","affix_0_id":11,"affix_1_id":14,"affix_2_id":10,"created_at":"2018-05-21T06:46:32.000Z","updated_at":"2018-05-21T06:46:34.000Z","deleted_at":null},{"id":9619597,"region_id":2,"realm_id":250,"keystone_team_id":16207501,"zone_id":7812,"faction":"horde","mythic_level":6,"clear_time_ms":712688,"par_time_ms":1440999,"period":644,"completed_at":"2018-05-04T18:56:31.000Z","affix_0_id":8,"affix_1_id":12,"affix_2_id":10,"created_at":"2018-05-04T19:18:38.000Z","updated_at":"2018-05-04T19:18:39.000Z","deleted_at":null}]},"dps":{"score":206.0251484938476,"scoreColor":"#ffffff","runs":[{"zoneId":7546,"keystoneRunId":10490105,"mythicLevel":15,"clearTimeMs":2254627,"score":138.60271568855072},{"zoneId":7812,"keystoneRunId":9619597,"mythicLevel":6,"clearTimeMs":712688,"score":67.42243280529688}],"rawRuns":[{"id":10490105,"region_id":2,"realm_id":257,"keystone_team_id":17018563,"zone_id":7546,"faction":"horde","mythic_level":15,"clear_time_ms":2254627,"par_time_ms":1980999,"period":646,"completed_at":"2018-05-21T06:28:13.000Z","affix_0_id":11,"affix_1_id":14,"affix_2_id":10,"created_at":"2018-05-21T06:46:32.000Z","updated_at":"2018-05-21T06:46:34.000Z","deleted_at":null},{"id":9619597,"region_id":2,"realm_id":250,"keystone_team_id":16207501,"zone_id":7812,"faction":"horde","mythic_level":6,"clear_time_ms":712688,"par_time_ms":1440999,"period":644,"completed_at":"2018-05-04T18:56:31.000Z","affix_0_id":8,"affix_1_id":12,"affix_2_id":10,"created_at":"2018-05-04T19:18:38.000Z","updated_at":"2018-05-04T19:18:39.000Z","deleted_at":null}]},"healer":{"score":0,"scoreColor":"#ffffff","runs":[],"rawRuns":[]},"tank":{"score":0,"scoreColor":"#ffffff","runs":[],"rawRuns":[]},"spec_0":{"score":206.0251484938476,"scoreColor":"#ffffff","runs":[{"zoneId":7546,"keystoneRunId":10490105,"mythicLevel":15,"clearTimeMs":2254627,"score":138.60271568855072},{"zoneId":7812,"keystoneRunId":9619597,"mythicLevel":6,"clearTimeMs":712688,"score":67.42243280529688}],"rawRuns":[{"id":10490105,"region_id":2,"realm_id":257,"keystone_team_id":17018563,"zone_id":7546,"faction":"horde","mythic_level":15,"clear_time_ms":2254627,"par_time_ms":1980999,"period":646,"completed_at":"2018-05-21T06:28:13.000Z","affix_0_id":11,"affix_1_id":14,"affix_2_id":10,"created_at":"2018-05-21T06:46:32.000Z","updated_at":"2018-05-21T06:46:34.000Z","deleted_at":null},{"id":9619597,"region_id":2,"realm_id":250,"keystone_team_id":16207501,"zone_id":7812,"faction":"horde","mythic_level":6,"clear_time_ms":712688,"par_time_ms":1440999,"period":644,"completed_at":"2018-05-04T18:56:31.000Z","affix_0_id":8,"affix_1_id":12,"affix_2_id":10,"created_at":"2018-05-04T19:18:38.000Z","updated_at":"2018-05-04T19:18:39.000Z","deleted_at":null}]},"spec_1":{"score":0,"scoreColor":"#ffffff","runs":[],"rawRuns":[]},"spec_2":{"score":0,"scoreColor":"#ffffff","runs":[],"rawRuns":[]},"spec_3":{"score":0,"scoreColor":"#ffffff","runs":[],"rawRuns":[]}},"bestMythicPlusScore":{"score":206.025,"scoreColor":"#ffffff","season":{"slug":"season-7.3.2","name":"Season 7.3.2"}},"keystoneAggregateStats":[{"level":5,"count":1}],"previousMythicPlusScore":{"score":0,"scoreColor":"#ffffff","season":{"slug":"season-7.3.0","name":"Season 7.3"}},"mythicPlusRanks":{"overall":{"world":2465364,"region":918758,"realm":2509},"class":{"world":214869,"region":78125,"realm":199},"tank":{"world":0,"region":0,"realm":0},"class_tank":{"world":0,"region":0,"realm":0},"dps":{"world":1768371,"region":657081,"realm":1734},"class_dps":{"world":161471,"region":57976,"realm":139},"spec_577":{"world":0,"region":0,"realm":0},"spec_581":{"world":0,"region":0,"realm":0}},"season":"season-7.3.2","tier":21,"isMissingPersonaFields":false,"isTournamentProfile":false}}